start_keyboard_text = {
    "message_text": "Выберите язык",
    "button_text": {
        "ru": "Русский 🇷🇺",
        "gb": "English 🇬🇧",
        "in": "हाय 🇮🇳"
    }
}
    

welcome_text = {
    "ru": """Привет! Добро пожаловать в PlayInChat! 🎮\n
          Здесь ты можешь играть в любимые игры через чат без скачивания и установки. Играй в Судоку, Тетрис, 3 в ряд, Крестики-нолики и другие игры прямо здесь и сейчас!\n
          <b>Выбери игру, чтобы начать!""",
    "gb": """Hello! Welcome to PlayInChat! 🎮\n
          Here you can play your favorite games through the chat without any downloads. Enjoy games like Sudoku, Tetris, 3 in a Row, Tic Tac Toe, and more right here, right now!\n
          Choose a game to get started""",
    "in": """नमस्ते! PlayInChat में आपका स्वागत है! 🎮\n
          यहां आप बिना कोई डाउनलोड किए अपने पसंदीदा खेलों को चैट के माध्यम से खेल सकते हैं। सुडोकू, टेट्रिस, 3 इन ए रो, क्रॉस और नोल और अन्य खेलों का आनंद लें!\n
          खेल शुरू करने के लिए खेल का चयन करें।"""
}