export const minesweeper_ranking_text = {
    "Легкая": {
        "ru": "Легкая",
        "gb": "Easy",
        "in": "साधारण"
    },
    "Средняя": {
        "ru": "Средняя",
        "gb": "Medium",
        "in": "मध्य"
    },
    "Сложная": {
        "ru": "Сложная",
        "gb": "Hard",
        "in": "बड़ा"
    }
}

export const minesweeper_win_text = {
    "ru": "Вы проявили находчивость и прошли испытание! 💣 Поздравляем!",
    "gb": "You showed bravery and passed the test! 💣 Congratulations!",
    "in": "आपको भरता हैं और टेस्ट पास कर लिया है! 💣 बधाई हो!"
}

export const minesweeper_lose_text = {
    "ru": "БУУУМ! 💥 Вы проиграли! Попробуйте ещё раз!",
    "gb": "BOOM! 💥 You lost! Try again!",
    "in": "बूम! 💥 आप लोस हो गया है! फिर से प्रयास करें!"
}